org/topics/ethereum.org
:PROPERTIES:
:ID:       450697de-6496-41b6-9c3c-2dba6c42c429
:END:
#+color: #94ec4b
#+created: 20210518200145451
#+modified: 20210611071832403
#+revision: 0
#+tags: Topics
#+title: Ethereum
#+type: text/vnd.tiddlywiki

* Wallet
** HDWallet
** ERC20
* Resource
- 2023-03-20 ◦ [[https://playground.zero-defense.com/blog/smart-contracts-security/][Smart Contracts Security: Exploring Common Bugs]]
- 2023-01-03 ◦ [[https://dev.to/yuryoparin/smart-contracts-blockchain-13-25ph][Smart Contracts (1/3) — Blockchain: Architecture, Security and Decentralization]]
  - nice diagrams
- 2022-12-15 ◦ [[https://medium.com/nerd-for-tech/smart-contract-with-golang-d208c92848a9][Smart Contract with Golang. Interacting with smart contracts]] (in [[id:b2831721-165d-4943-a41a-da770d96be41][Golang]])
- 2022-12-15 ◦ [[https://towardsdev.com/creating-a-simple-ethereum-smart-contract-in-golang-138b9439f64e][Creating a simple Ethereum Smart Contract]] (in [[id:b2831721-165d-4943-a41a-da770d96be41][Golang]])
  - Uses
    - Solidity
    - Golang and ~echo~ web framework
    - Geth
    - Ganache or ganache-cli
** Solidity
- 2023-03-27 ◦ [[https://github.com/saeidshirazi/Awesome-Smart-Contract-Security][GitHub - saeidshirazi/Awesome-Smart-Contract-Security: A curated list of Smart Contract Security materials and resources For Researchers]]
- 2023-02-08 ◦ [[https://github.com/ajlopez/SoliditySamples][GitHub - ajlopez/SoliditySamples: Solidity Smart Contracts Samples]]
** Security
- 2023-10-23 ◦ [[https://labs.guard.io/etherhiding-hiding-web2-malicious-code-in-web3-smart-contracts-65ea78efad16][“EtherHiding” — Hiding Web2 Malicious Code in Web3 Smart Contracts]]
- 2023-07-27 ◦ [[https://scsfg.io/][Smart Contract Security Field Guide]]
- 2023-05-10 ◦ [[https://blog.sigmaprime.io/solidity-security.html][Solidity Security: Comprehensive list of known attack vectors and common anti-patterns]]
- 2023-05-10 ◦ [[https://medium.com/loom-network/how-to-secure-your-smart-contracts-6-solidity-vulnerabilities-and-how-to-avoid-them-part-1-c33048d4d17d][How to Secure Your Smart Contracts: 6 Solidity Vulnerabilities and how to avoid them (Part 1) | by Georgios Konstantopoulos | Loom Network | Medium]]
- 2023-05-10 ◦ [[https://medium.com/loom-network/how-to-secure-your-smart-contracts-6-solidity-vulnerabilities-and-how-to-avoid-them-part-2-730db0aa4834][How to Secure Your Smart Contracts: 6 Solidity Vulnerabilities and how to avoid them (Part 2) | by Georgios Konstantopoulos | Loom Network | Medium]]
- 2023-05-10 ◦ [[https://www.youtube.com/watch?v=6dPekVyZ8iA&ab_channel=Chainlink][Harry Papacharissiou: Learning How to Build Secure Smart Contracts - YouTube]]
  - Programming smart contracts requires a different
    - programming mindset
    - Cost of failure can be high
    - Changes can be difficult
    - Similar to hardware development
  - Attacks
    - Timestamp Dependence and Manipulation
- 2023-02-01 ◦ [[https://dev.to/erhant/damn-vulnerable-defi-1-unstoppable-4824][Damn Vulnerable Defi]]
  - [[https://www.damnvulnerabledefi.xyz/][Github Repository]]
