content/topics/ethereum.md
+++
title = "Ethereum"
draft = false
+++

## Wallet {#wallet}


### HDWallet {#hdwallet}


### ERC20 {#erc20}


## Resource {#resource}

-   2023-03-20 ◦ [Smart Contracts Security: Exploring Common Bugs](https://playground.zero-defense.com/blog/smart-contracts-security/)
-   2023-01-03 ◦ [Smart Contracts (1/3) — Blockchain: Architecture, Security and Decentralization](https://dev.to/yuryoparin/smart-contracts-blockchain-13-25ph)
    -   nice diagrams
-   2022-12-15 ◦ [Smart Contract with Golang. Interacting with smart contracts](https://medium.com/nerd-for-tech/smart-contract-with-golang-d208c92848a9) (in [Golang]({{< relref "golang.md" >}}))
-   2022-12-15 ◦ [Creating a simple Ethereum Smart Contract](https://towardsdev.com/creating-a-simple-ethereum-smart-contract-in-golang-138b9439f64e) (in [Golang]({{< relref "golang.md" >}}))
    -   Uses
        -   Solidity
        -   Golang and `echo` web framework
        -   Geth
        -   Ganache or ganache-cli


### Solidity {#solidity}

-   2023-03-27 ◦ [GitHub - saeidshirazi/Awesome-Smart-Contract-Security: A curated list of Smart Contract Security materials and resources For Researchers](https://github.com/saeidshirazi/Awesome-Smart-Contract-Security)
-   2023-02-08 ◦ [GitHub - ajlopez/SoliditySamples: Solidity Smart Contracts Samples](https://github.com/ajlopez/SoliditySamples)


### Security {#security}

-   2023-05-10 ◦ [Solidity Security: Comprehensive list of known attack vectors and common anti-patterns](https://blog.sigmaprime.io/solidity-security.html)
-   2023-05-10 ◦ [How to Secure Your Smart Contracts: 6 Solidity Vulnerabilities and how to avoid them (Part 1) | by Georgios Konstantopoulos | Loom Network | Medium](https://medium.com/loom-network/how-to-secure-your-smart-contracts-6-solidity-vulnerabilities-and-how-to-avoid-them-part-1-c33048d4d17d)
-   2023-05-10 ◦ [How to Secure Your Smart Contracts: 6 Solidity Vulnerabilities and how to avoid them (Part 2) | by Georgios Konstantopoulos | Loom Network | Medium](https://medium.com/loom-network/how-to-secure-your-smart-contracts-6-solidity-vulnerabilities-and-how-to-avoid-them-part-2-730db0aa4834)
-   2023-05-10 ◦ [Harry Papacharissiou: Learning How to Build Secure Smart Contracts - YouTube](https://www.youtube.com/watch?v=6dPekVyZ8iA&ab_channel=Chainlink)
    -   Programming smart contracts requires a different
        -   programming mindset
        -   Cost of failure can be high
        -   Changes can be difficult
        -   Similar to hardware development
    -   Attacks
        -   Timestamp Dependence and Manipulation
-   2023-02-01 ◦ [Damn Vulnerable Defi](https://dev.to/erhant/damn-vulnerable-defi-1-unstoppable-4824)
    -   [Github Repository](https://www.damnvulnerabledefi.xyz/)
